const sendCommand = require('../utils/sendCommand');

require('../toBeEmptyResponse');

function checkResult(res, longArray, shortArray) {
    expect(res).toHaveLength(2);
    const [longHeader, ...longRes] = res[0];
    expect(longHeader).toBe('*ДЛИННЫЕ*');
    expect(longRes).toEqual(longArray);

    const [shortHeader, ...shortRes] = res[1];
    expect(shortHeader).toEqual('*КОРОТКИЕ*');
    expect(shortRes).toEqual(shortArray);
}

describe('rebus', () => {
    beforeAll(async () => {
        await sendCommand('/rebus');
    });

    test('без результатов', async () => {
        const res = await sendCommand('цил ккк');
        checkResult(res, ['Нет результатов'], ['Нет результатов']);
    });

    test('нашлись только длинные', async () => {
        const res = await sendCommand('цит кл');
        checkResult(res, [
            'КЛавиЦИТериум',
            "циКЛоЦИТраль",
            "КЛазматоЦИТ",
        ], [
            "кальКЛаЦИТ",
            "КЛазмоЦИТ",
        ]);
    });

    test('нашлись и длинные, и короткие', async () => {
        const res = await sendCommand('цик оп');
        checkResult(res, [
            "энЦИКлОПедичность",
            "энЦИКлОПедический",
            "этилЦИКлОПентан",
            "энЦИКлОПедистка",
            "ЦИКлОПропиламин",
            "ЦИКлОПропенилий",
            "ЦИКлОПолиолефин",
            "ЦИКлОПентатрион",
            "ЦИКлОПентантиол",
            "ЦИКлОПентандиил",
            "цианЦИКлОПропан",
            "хлорЦИКлОПропен",
            "хлорЦИКлОПентен",
            "силаЦИКлОПропан",
            "силаЦИКлОПентан",
            "оксоЦИКлОПентил",
            "медэнЦИКлОПедия",
            "диЦИКлОПентенил",
            "бромЦИКлОПропан",
            "бораЦИКлОПропен",
            "ацилЦИКлОПентен",
            "арсаЦИКлОПропан",
            "ЦИКлотрипрОПил",
            "ЦИКлОПрочность",
            "ЦИКлОПентадион",
            "триЦИКлОПропил",
            "тиаЦИКлОПропан",
            "тиаЦИКлОПентан",
            "азаЦИКлОПропен",
            "азаЦИКлОПентен",
            "энЦИКлОПедист",
            "ЦИКлОПропенон",
            "ЦИКлОПропанон",
            "ЦИКлОПолиамин",
            "ЦИКлОПентолат",
            "ЦИКлОПентенон",
            "ЦИКлОПентанон",
            "диЦИКлОПентил",
            "биЦИКлОПентан",
            "ЦИКлОПарафины",
            "энЦИКлОПедия",
            "ЦИКлОПротрин",
            "ЦИКлОПарафин",
            "ЦИКлоскОПия",
            "ЦИКлОПтерис",
            "ЦИКлОПропен",
            "ЦИКлОПолиен",
            "ЦИКлОПирокс",
            "ЦИКлОПентин",
            "ЦИКлОПентен",
            "ЦИКадОПсида",

        ], [
            "ЦИКлОПия",
            "ЦИКлОПы",
            "ЦИКлОП",
        ]);
    });
});
