const sendCommand = require('../utils/sendCommand');
const {RESPONSES: {NO_RESULT}} = require("../../constants");

require('../toBeEmptyResponse');

function checkResult(res, longArray, shortArray) {
    expect(res).toHaveLength(2);
    const [longHeader, ...longRes] = res[0];
    expect(longHeader).toBe('*ДЛИННЫЕ*');
    expect(longRes).toEqual(longArray);

    const [shortHeader, ...shortRes] = res[1];
    expect(shortHeader).toEqual('*КОРОТКИЕ*');
    expect(shortRes).toEqual(shortArray);
}

describe('rebus', () => {
    beforeAll(async () => {
        await sendCommand('/rebus');
    });

    test('без результатов', async () => {
        const res = await sendCommand('цил ккк');
        checkResult(res, [NO_RESULT], [NO_RESULT]);
    });

    test('нашлись только длинные', async () => {
        const res = await sendCommand('цит кл');
        checkResult(res, [
            'КЛавиЦИТериум',
            "циКЛоЦИТраль",
            "КЛазматоЦИТ",
        ], [
            "кальКЛаЦИТ",
            "КЛазмоЦИТ",
        ]);
    });

    test('нашлись и длинные, и короткие', async () => {
        const res = await sendCommand('цик оп');
        checkResult(res, [
            "энЦИКлОПедичность",
            "энЦИКлОПедический",
            "этилЦИКлОПентан",
            "энЦИКлОПедистка",
            "ЦИКлОПропиламин",
            "ЦИКлОПропентион",
            "ЦИКлОПропенилий",
            "ЦИКлОПолифосфин",
            "ЦИКлОПолиолефин",
            "ЦИКлОПентилиден",
            "ЦИКлОПентатрион",
            "ЦИКлОПентасилан",
            "ЦИКлОПентантиол",
            "ЦИКлОПентандион",
            "ЦИКлОПентандиил",
            "ЦИКлОПентадекан",
            "цианЦИКлОПропан",
            "хлорЦИКлОПропен",
            "хлорЦИКлОПропан",
            "хлорЦИКлОПентен",
            "хлорЦИКлОПентан",
            "силаЦИКлОПропан",
            "силаЦИКлОПентен",
            "силаЦИКлОПентан",
            "оксоЦИКлОПентил",
            "медэнЦИКлОПедия",
            "диЦИКлОПентенил",
            "бромЦИКлОПропан",
            "бромЦИКлОПентан",
            "бораЦИКлОПропен",
            "бораЦИКлОПентан",
            "ацилЦИКлОПентен",
            "арсаЦИКлОПропан",
            "энЦИКлОПедичный",
            "ЦИКлотрипрОПил",
            "ЦИКлОПрочность",
            "ЦИКлОПентиазид",
            "ЦИКлОПентадион",
            "ЦИКлОПентадиен",
            "триЦИКлОПропил",
            "триЦИКлОПентил",
            "тиаЦИКлОПропан",
            "тиаЦИКлОПентен",
            "тиаЦИКлОПентан",
            "азаЦИКлОПропен",
            "азаЦИКлОПропан",
            "азаЦИКлОПентен",
            "энЦИКлОПедист",
            "энЦИКлОПедизм",
            "ЦИКлОПропенон",
            "ЦИКлОПропенил",
            "ЦИКлОПропанон",
            "ЦИКлОПропанол",
            "ЦИКлОПолиамин",
            "ЦИКлОПероксид",
            "ЦИКлОПентолат",
            "ЦИКлОПентилен",
            "ЦИКлОПентенон",
            "ЦИКлОПентенил",
            "ЦИКлОПентанон",
            "ЦИКлОПентанол",
            "диЦИКлОПентил",
            "биЦИКлОПентан",
            "ЦИКлОПарафины",
            "ЦИКлОПический",
            "энЦИКлОПедия",
            "ЦИКлОПротрин",
            "ЦИКлОПолимер",
            "ЦИКлОПарафин",
            "ЦИКлоскОПия",
            "ЦИКлОПтерис",
            "ЦИКлОПропил",
            "ЦИКлОПропен",
            "ЦИКлОПропан",
            "ЦИКлОПолиен",
            "ЦИКлОПлегия",
            "ЦИКлОПирокс",
            "ЦИКлОПептид",
            "ЦИКлОПентин",
            "ЦИКлОПентил",
            "ЦИКлОПентен",
            "ЦИКлОПентан",
            "ЦИКадОПсида",

        ], [
            "ЦИКлОПия",
            "ЦИКлОПит",
            "ЦИКлОПы",
            "ЦИКлОП",
        ]);
    });
});
